In [56]:
import numpy as np
import matplotlib.pyplot as plt
import math
import pandas as pd
from numpy.random import randn,randint
np.random.seed(10)

In [150]:
labels = ["a","b","c"]
arr = np.array([10,20,30])

In [151]:
d = {"a": 10, "b": 20, "c": 30}

In [152]:
pd.Series(data=arr)

0    10
1    20
2    30
dtype: int64

In [153]:
pd.Series(data=arr, index=labels)

a    10
b    20
c    30
dtype: int64

In [154]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [155]:
pd.Series([5,6,7], index=["q","w","e"])

q    5
w    6
e    7
dtype: int64

In [156]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [157]:
a = pd.Series([1,3,7,9],["Computer","Monitor","Mouse","Keyboard"])

In [158]:
b = pd.Series([5,6,9,10],["Computer","Monitor","Mouse","Hard Disk"])

In [159]:
a+b

Computer      6.0
Hard Disk     NaN
Keyboard      NaN
Monitor       9.0
Mouse        16.0
dtype: float64

In [160]:
a["Computer":"Mouse"]

Computer    1
Monitor     3
Mouse       7
dtype: int64

In [161]:
for i in "abc":
    print(i)

a
b
c

In [162]:
pd.Series([10,20,30],"a b c".split())

a    10
b    20
c    30
dtype: int64

In [163]:
df = pd.DataFrame(randn(5,4), index="A B C D E".split(), 
                  columns="W X Y Z".split())

In [164]:
df

          W         X         Y         Z
A -1.977728 -1.743372  0.266070  2.384967
B  1.123691  1.672622  0.099149  1.397996
C -0.271248  0.613204 -0.267317 -0.549309
D  0.132708 -0.476142  1.308473  0.195013
E  0.400210 -0.337632  1.256472 -0.731970

In [165]:
df["W"]

A   -1.977728
B    1.123691
C   -0.271248
D    0.132708
E    0.400210
Name: W, dtype: float64

In [166]:
df["W"] + df["X"]

A   -3.721101
B    2.796313
C    0.341956
D   -0.343434
E    0.062578
dtype: float64

In [167]:
df[["W","X"]]

          W         X
A -1.977728 -1.743372
B  1.123691  1.672622
C -0.271248  0.613204
D  0.132708 -0.476142
E  0.400210 -0.337632

In [168]:
df.W

A   -1.977728
B    1.123691
C   -0.271248
D    0.132708
E    0.400210
Name: W, dtype: float64

In [169]:
df["new"] = [3,7,9,10,12]

In [170]:
df

          W         X         Y         Z  new
A -1.977728 -1.743372  0.266070  2.384967    3
B  1.123691  1.672622  0.099149  1.397996    7
C -0.271248  0.613204 -0.267317 -0.549309    9
D  0.132708 -0.476142  1.308473  0.195013   10
E  0.400210 -0.337632  1.256472 -0.731970   12

In [171]:
df["total"] = df["X"] + df["Z"]

In [172]:
df["W total new X Y Z".split()]

          W     total  new         X         Y         Z
A -1.977728  0.641595    3 -1.743372  0.266070  2.384967
B  1.123691  3.070619    7  1.672622  0.099149  1.397996
C -0.271248  0.063895    9  0.613204 -0.267317 -0.549309
D  0.132708 -0.281129   10 -0.476142  1.308473  0.195013
E  0.400210 -1.069602   12 -0.337632  1.256472 -0.731970

In [173]:
type(df[["W","X"]])

pandas.core.frame.DataFrame

In [174]:
type(df[["W"]])

pandas.core.frame.DataFrame

In [175]:
df.drop("new",axis=1)

          W         X         Y         Z     total
A -1.977728 -1.743372  0.266070  2.384967  0.641595
B  1.123691  1.672622  0.099149  1.397996  3.070619
C -0.271248  0.613204 -0.267317 -0.549309  0.063895
D  0.132708 -0.476142  1.308473  0.195013 -0.281129
E  0.400210 -0.337632  1.256472 -0.731970 -1.069602

In [176]:
df

          W         X         Y         Z  new     total
A -1.977728 -1.743372  0.266070  2.384967    3  0.641595
B  1.123691  1.672622  0.099149  1.397996    7  3.070619
C -0.271248  0.613204 -0.267317 -0.549309    9  0.063895
D  0.132708 -0.476142  1.308473  0.195013   10 -0.281129
E  0.400210 -0.337632  1.256472 -0.731970   12 -1.069602

In [177]:
df.drop("Z",axis=1,inplace=True)

In [178]:
df

          W         X         Y  new     total
A -1.977728 -1.743372  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C -0.271248  0.613204 -0.267317    9  0.063895
D  0.132708 -0.476142  1.308473   10 -0.281129
E  0.400210 -0.337632  1.256472   12 -1.069602

In [179]:
df.drop("E")

          W         X         Y  new     total
A -1.977728 -1.743372  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C -0.271248  0.613204 -0.267317    9  0.063895
D  0.132708 -0.476142  1.308473   10 -0.281129

In [180]:
df

          W         X         Y  new     total
A -1.977728 -1.743372  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C -0.271248  0.613204 -0.267317    9  0.063895
D  0.132708 -0.476142  1.308473   10 -0.281129
E  0.400210 -0.337632  1.256472   12 -1.069602

In [181]:
df.loc["C"]

W       -0.271248
X        0.613204
Y       -0.267317
new      9.000000
total    0.063895
Name: C, dtype: float64

In [182]:
type(df.loc["C"])

pandas.core.series.Series

In [183]:
df.iloc[2]

W       -0.271248
X        0.613204
Y       -0.267317
new      9.000000
total    0.063895
Name: C, dtype: float64

In [184]:
df.loc["B":"D",["X","Y"]]

          X         Y
B  1.672622  0.099149
C  0.613204 -0.267317
D -0.476142  1.308473

In [185]:
df.iloc[1:3,2:4]

          Y  new
B  0.099149    7
C -0.267317    9

In [186]:
df>0

       W      X      Y   new  total
A  False  False   True  True   True
B   True   True   True  True   True
C  False   True  False  True   True
D   True  False   True  True  False
E   True  False   True  True  False

In [187]:
df[df>0]

          W         X         Y  new     total
A       NaN       NaN  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C       NaN  0.613204       NaN    9  0.063895
D  0.132708       NaN  1.308473   10       NaN
E  0.400210       NaN  1.256472   12       NaN

In [189]:
df

          W         X         Y  new     total
A -1.977728 -1.743372  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C -0.271248  0.613204 -0.267317    9  0.063895
D  0.132708 -0.476142  1.308473   10 -0.281129
E  0.400210 -0.337632  1.256472   12 -1.069602

In [190]:
df.append(
    pd.DataFrame([[10,11,12,13]],index=["P"],
                 columns="W X Y total".split()))

/home/student/anaconda3/lib/python3.6/site-packages/pandas/core/frame.py:6201: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  sort=sort)

           W          X          Y   new      total
A  -1.977728  -1.743372   0.266070   3.0   0.641595
B   1.123691   1.672622   0.099149   7.0   3.070619
C  -0.271248   0.613204  -0.267317   9.0   0.063895
D   0.132708  -0.476142   1.308473  10.0  -0.281129
E   0.400210  -0.337632   1.256472  12.0  -1.069602
P  10.000000  11.000000  12.000000   NaN  13.000000

In [191]:
df

          W         X         Y  new     total
A -1.977728 -1.743372  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C -0.271248  0.613204 -0.267317    9  0.063895
D  0.132708 -0.476142  1.308473   10 -0.281129
E  0.400210 -0.337632  1.256472   12 -1.069602

In [192]:
(df["W"]>0) & (df["X"]>0)

A    False
B     True
C    False
D    False
E    False
dtype: bool

In [193]:
(df["W"]>0) | (df["X"]>0)

A    False
B     True
C     True
D     True
E     True
dtype: bool

In [195]:
u

          W         X       Y     total
A  1.331587  0.715279 -1.5454  0.706895
B  1.000000  2.000000  3.0000  4.000000
F  1.000000  2.000000  3.0000  4.000000
Z  1.000000  2.000000  3.0000  9.000000
K  1.000000  2.000000  3.0000  6.000000

In [196]:
df[(df["W"]>0) & (df["X"]>0)].iloc[0:2]

          W         X         Y  new     total
B  1.123691  1.672622  0.099149    7  3.070619

In [197]:
df[(df["W"]>0) & (df["X"]>0)].iloc[0]

W        1.123691
X        1.672622
Y        0.099149
new      7.000000
total    3.070619
Name: B, dtype: float64

In [198]:
type(df[(df["W"]>0) & (df["X"]>0)])

pandas.core.frame.DataFrame

In [199]:
df.reset_index(inplace=True)

In [200]:
df

  index         W         X         Y  new     total
0     A -1.977728 -1.743372  0.266070    3  0.641595
1     B  1.123691  1.672622  0.099149    7  3.070619
2     C -0.271248  0.613204 -0.267317    9  0.063895
3     D  0.132708 -0.476142  1.308473   10 -0.281129
4     E  0.400210 -0.337632  1.256472   12 -1.069602

In [201]:
df.index = list(df["index"])

In [202]:
df.drop("index",axis=1,inplace=True)

In [203]:
df

          W         X         Y  new     total
A -1.977728 -1.743372  0.266070    3  0.641595
B  1.123691  1.672622  0.099149    7  3.070619
C -0.271248  0.613204 -0.267317    9  0.063895
D  0.132708 -0.476142  1.308473   10 -0.281129
E  0.400210 -0.337632  1.256472   12 -1.069602

# Multi-Index

In [204]:
mdf = pd.DataFrame(randn(6,3),columns = ["A","B","C"])

In [213]:
mdf.index = pd.MultiIndex(
    levels=[["Almaty","Astana"],
    ["Kids","Male","Female"]],
    labels=[[0,0,0,1,1,1],[0,1,2,0,1,2]]
    )

In [214]:
mdf

                      A         B         C
Almaty Kids    0.660232 -0.350872 -0.939433
       Male   -0.489337 -0.804591 -0.212698
       Female -0.339140  0.312170  0.565153
Astana Kids   -0.147420 -0.025905  0.289094
       Male   -0.539879  0.708160  0.842225
       Female  0.203581  2.394704  0.917459

In [248]:
mdf.index.names=["City","Sex"]
mdf.columns=["I","J","K"]
mdf.columns.names=["Cols"]

In [249]:
mdf

Cols                  I         J         K
City   Sex
Almaty Kids    0.660232 -0.350872 -0.939433
       Male   -0.489337 -0.804591 -0.212698
       Female -0.339140  0.312170  0.565153
Astana Kids   -0.147420 -0.025905  0.289094
       Male   -0.539879  0.708160  0.842225
       Female  0.203581  2.394704  0.917459

In [222]:
mdf.loc["Almaty"]

               A         B         C
Sex
Kids    0.660232 -0.350872 -0.939433
Male   -0.489337 -0.804591 -0.212698
Female -0.339140  0.312170  0.565153

In [224]:
mdf.loc["Almaty"].loc["Male"]

A   -0.489337
B   -0.804591
C   -0.212698
Name: Male, dtype: float64

In [226]:
mdf.xs(["Almaty","Male"])

A   -0.489337
B   -0.804591
C   -0.212698
Name: (Almaty, Male), dtype: float64

In [230]:
mdf.xs("Male",level="Sex")

               A         B         C
City
Almaty -0.489337 -0.804591 -0.212698
Astana -0.539879  0.708160  0.842225

In [231]:
mdf

                      A         B         C
City   Sex
Almaty Kids    0.660232 -0.350872 -0.939433
       Male   -0.489337 -0.804591 -0.212698
       Female -0.339140  0.312170  0.565153
Astana Kids   -0.147420 -0.025905  0.289094
       Male   -0.539879  0.708160  0.842225
       Female  0.203581  2.394704  0.917459

In [236]:
mdf["A"]["Almaty"]["Kids"]

0.6602315512263132

In [250]:
df1 = pd.DataFrame({
    "A":[1,2,np.nan],
    "B":[5,np.nan,np.nan],
    "C":[1,2,3]
})

In [251]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [252]:
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [253]:
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [256]:
df1.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [260]:
df1["A"] = df1["A"].fillna(value=df1["A"].mean())

In [261]:
df1["A"].mean()

1.5

In [262]:
df1["A"]

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [265]:
for col in df1.columns:
    df1[col] = df1[col].fillna(value=df1[col].mean())

In [266]:
df1

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [282]:
data = {
    "Company": ["GOOG","GOOG","GOOG","MSFT","MSFT","FB","FB"],
    "Person": ["Sam", "Charlie","Ho","Amy","Vanessa","Carl", "Sarah"],
    "Sales": [200,120,500,340,124,243,350],
}

In [283]:
df = pd.DataFrame(data)

In [284]:
df.head(3)

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG       Ho    500

In [285]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    GOOG       Ho    500
3    MSFT      Amy    340
4    MSFT  Vanessa    124
5      FB     Carl    243
6      FB    Sarah    350

In [286]:
df.groupby("Company")

In [287]:
df.groupby("Company").mean()

              Sales
Company
FB       296.500000
GOOG     273.333333
MSFT     232.000000

In [288]:
df.groupby("Company").std()

              Sales
Company
FB        75.660426
GOOG     200.333056
MSFT     152.735065

In [289]:
df.groupby("Company").min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [291]:
df[["Company","Person"]].groupby("Company").count()

         Person
Company
FB            2
GOOG          3
MSFT          2

In [294]:
df.groupby("Company").describe().T

Company              FB        GOOG        MSFT
Sales count    2.000000    3.000000    2.000000
      mean   296.500000  273.333333  232.000000
      std     75.660426  200.333056  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  160.000000  178.000000
      50%    296.500000  200.000000  232.000000
      75%    323.250000  350.000000  286.000000
      max    350.000000  500.000000  340.000000

In [295]:
pwd

'/home/student/Desktop/Datasets/pandas'

In [297]:
df = pd.read_csv("train.csv")

In [298]:
df.head()

,Id,Product_Info_1,Product_Info_2,Product_Info_3,Product_Info_4,Product_Info_5,Product_Info_6,Product_Info_7,Ins_Age,Ht,...,Medical_Keyword_40,Medical_Keyword_41,Medical_Keyword_42,Medical_Keyword_43,Medical_Keyword_44,Medical_Keyword_45,Medical_Keyword_46,Medical_Keyword_47,Medical_Keyword_48,Response
0,2,1,D3,10,0.076923,2,1,1,0.641791,0.581818,...,0,0,0,0,0,0,0,0,0,8
1,5,1,A1,26,0.076923,2,3,1,0.059701,0.600000,...,0,0,0,0,0,0,0,0,0,4
2,6,1,E1,26,0.076923,2,3,1,0.029851,0.745455,...,0,0,0,0,0,0,0,0,0,8
3,7,1,D4,10,0.487179,2,3,1,0.164179,0.672727,...,0,0,0,0,0,0,0,0,0,8
4,8,1,D2,26,0.230769,2,3,1,0.417910,0.654545,...,0,0,0,0,0,0,0,0,0,8

In [299]:
df = pd.read_json("mia.json")

In [300]:
df

,id,kategoriia_personala,kolichestvo_vakansii,name
0,1,"Государственные служащие корпуса ""В""",1,Руководитель Управления медиа-аналитики Департ...
1,4,"Государственные служащие корпуса ""В""",1,Главный эксперт Управления правового обеспечен...
2,8,"Государственные служащие корпуса ""В""",1,Эксперт Управления планирования и финансирован...
3,13,"Государственные служащие корпуса ""В""",1,Эксперт группы по мониторингу Управления по го...
4,3,"Государственные служащие корпуса ""В""",1,Эксперт группы мониторинга и анализа Управлени...
5,7,"Государственные служащие корпуса ""В""",2,Главный эксперт Управления планирования и фина...
6,12,"Государственные служащие корпуса ""В""",1,Эксперт группы по государственным закупкам Упр...
7,17,"Государственные служащие корпуса ""В""",19,ВСЕГО
8,2,"Государственные служащие корпуса ""В""",3,Эксперт группы по разработке и продвижению PR-...
9,6,"Государственные служащие корпуса ""В""",1,Эксперт Управления договорной и претензионно-и...